** 42

   #+begin_src cpp
     #include <iostream>
     #include <numeric>

     using namespace std;

     int func(int *a, int n) {
       int ia = 0, ib = n-1, ic = ia + (ib-ia)/2;
       if (ic == ia)
         return min(a[ia], a[ib]);
       if (a[ic] < a[ia])
         return func(a, ic + 1);
       return func(a + ia + 1, n - ia - 1);
     }

     int a[] = {5, 6, 7, 1, 2, 3, 4};

     int main() {
       cout << func(a, 7);
       return 0;
     }
   #+end_src

   #+RESULTS:
   : 1

